In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [3]:
#load the datasets
customer_data = pd.read_csv('./DataSets/Customer_ID.csv')

In [4]:
customer_data.head(10)

   Customer ID Gender  Age  Income (USD/Month)
0        29290   Male   28               10813
1        27703   Male   27                9237
2        28712   Male   53               11242
3        28020   Male   23               23327
4        27182   Male   33                8536
5        27318   Male   25               13984
6        33788   Male   23               23788
7        34106   Male   19               19980
8        59799   Male   33               19271
9        57982   Male   57                5068

In [5]:
customer_data.shape

(49171, 4)